In [7]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [8]:
melb_data = pd.read_csv('datasets/melbourne_data.csv')

In [9]:
melb_data.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,68 Studley St,2,h,NaN,SS,Jellis,3/09/2016,2.5,3067.0,...,1.0,1.0,126.0,NaN,NaN,Yarra City Council,-37.8014,144.9958,Northern Metropolitan,4019.0
1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra City Council,-37.7996,144.9984,Northern Metropolitan,4019.0
2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra City Council,-37.8079,144.9934,Northern Metropolitan,4019.0
3,Abbotsford,18/659 Victoria St,3,u,NaN,VB,Rounds,4/02/2016,2.5,3067.0,...,2.0,1.0,0.0,NaN,NaN,Yarra City Council,-37.8114,145.0116,Northern Metropolitan,4019.0
4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra City Council,-37.8093,144.9944,Northern Metropolitan,4019.0

In [10]:
melb_data.shape

(34857, 21)

In [11]:
empty_col_cells = melb_data.isnull().sum().sort_values(ascending=False)

empty_col_cells.head()

BuildingArea    21115
YearBuilt       19306
Landsize        11810
Car              8728
Bathroom         8226
dtype: int64

In [12]:
 (melb_data.isnull().sum() / melb_data.shape[0]).sort_values(ascending=False)

BuildingArea     0.605761
YearBuilt        0.553863
Landsize         0.338813
Car              0.250394
Bathroom         0.235993
Bedroom2         0.235735
Longtitude       0.228821
Lattitude        0.228821
Price            0.218321
Regionname       0.000086
Propertycount    0.000086
CouncilArea      0.000086
Postcode         0.000029
Distance         0.000029
Date             0.000000
SellerG          0.000000
Method           0.000000
Type             0.000000
Rooms            0.000000
Address          0.000000
Suburb           0.000000
dtype: float64

In [15]:
 melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].head()

,BuildingArea,YearBuilt,Landsize,Car,Bathroom,Bedroom2,Longtitude,Lattitude,Price
0,NaN,NaN,126.0,1.0,1.0,2.0,144.9958,-37.8014,NaN
1,NaN,NaN,202.0,1.0,1.0,2.0,144.9984,-37.7996,1480000.0
2,79.0,1900.0,156.0,0.0,1.0,2.0,144.9934,-37.8079,1035000.0
3,NaN,NaN,0.0,1.0,2.0,3.0,145.0116,-37.8114,NaN
4,150.0,1900.0,134.0,0.0,2.0,3.0,144.9944,-37.8093,1465000.0

In [17]:
 melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].isnull().sum()

BuildingArea    21115
YearBuilt       19306
Landsize        11810
Car              8728
Bathroom         8226
Bedroom2         8217
Longtitude       7976
Lattitude        7976
Price            7610
dtype: int64

In [18]:
 melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].describe()

,BuildingArea,YearBuilt,Landsize,Car,Bathroom,Bedroom2,Longtitude,Lattitude,Price
count,13742.00000,15551.000000,23047.000000,26129.000000,26631.000000,26640.000000,26881.000000,26881.000000,2.724700e+04
mean,160.25640,1965.289885,593.598993,1.728845,1.624798,3.084647,145.001851,-37.810634,1.050173e+06
std,401.26706,37.328178,3398.841946,1.010771,0.724212,0.980690,0.120169,0.090279,6.414671e+05
min,0.00000,1196.000000,0.000000,0.000000,0.000000,0.000000,144.423790,-38.190430,8.500000e+04
25%,102.00000,1940.000000,224.000000,1.000000,1.000000,2.000000,144.933500,-37.862950,6.350000e+05
50%,136.00000,1970.000000,521.000000,2.000000,2.000000,3.000000,145.007800,-37.807600,8.700000e+05
75%,188.00000,2000.000000,670.000000,2.000000,2.000000,4.000000,145.071900,-37.754100,1.295000e+06
max,44515.00000,2106.000000,433014.000000,26.000000,12.000000,30.000000,145.526350,-37.390200,1.120000e+07

In [22]:
melb_data['Car'] = melb_data['Car'].fillna(melb_data['Car'].median())

melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].describe()

,BuildingArea,YearBuilt,Landsize,Car,Bathroom,Bedroom2,Longtitude,Lattitude,Price
count,13742.00000,15551.000000,23047.000000,34857.000000,26631.000000,26640.000000,26881.000000,26881.000000,2.724700e+04
mean,160.25640,1965.289885,593.598993,1.796741,1.624798,3.084647,145.001851,-37.810634,1.050173e+06
std,401.26706,37.328178,3398.841946,0.882969,0.724212,0.980690,0.120169,0.090279,6.414671e+05
min,0.00000,1196.000000,0.000000,0.000000,0.000000,0.000000,144.423790,-38.190430,8.500000e+04
25%,102.00000,1940.000000,224.000000,1.000000,1.000000,2.000000,144.933500,-37.862950,6.350000e+05
50%,136.00000,1970.000000,521.000000,2.000000,2.000000,3.000000,145.007800,-37.807600,8.700000e+05
75%,188.00000,2000.000000,670.000000,2.000000,2.000000,4.000000,145.071900,-37.754100,1.295000e+06
max,44515.00000,2106.000000,433014.000000,26.000000,12.000000,30.000000,145.526350,-37.390200,1.120000e+07

In [23]:
 melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].isnull().sum()

BuildingArea    21115
YearBuilt       19306
Landsize        11810
Car                 0
Bathroom         8226
Bedroom2         8217
Longtitude       7976
Lattitude        7976
Price            7610
dtype: int64

In [24]:
 melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].tail()

,BuildingArea,YearBuilt,Landsize,Car,Bathroom,Bedroom2,Longtitude,Lattitude,Price
34852,NaN,NaN,593.0,3.0,1.0,4.0,144.88467,-37.81053,1480000.0
34853,104.0,2018.0,98.0,1.0,2.0,2.0,144.88826,-37.81551,888000.0
34854,120.0,2000.0,220.0,2.0,1.0,2.0,144.87856,-37.82286,705000.0
34855,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,1140000.0
34856,103.0,1930.0,250.0,0.0,1.0,2.0,144.89351,-37.81810,1020000.0

In [25]:
melb_data['Landsize'].mode()

0    0.0
dtype: float64

In [26]:
melb_data['Landsize'] = melb_data['Landsize'].fillna(melb_data['Landsize'].mode()[0])

In [27]:
melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].tail()

,BuildingArea,YearBuilt,Landsize,Car,Bathroom,Bedroom2,Longtitude,Lattitude,Price
34852,NaN,NaN,593.0,3.0,1.0,4.0,144.88467,-37.81053,1480000.0
34853,104.0,2018.0,98.0,1.0,2.0,2.0,144.88826,-37.81551,888000.0
34854,120.0,2000.0,220.0,2.0,1.0,2.0,144.87856,-37.82286,705000.0
34855,NaN,NaN,0.0,2.0,NaN,NaN,NaN,NaN,1140000.0
34856,103.0,1930.0,250.0,0.0,1.0,2.0,144.89351,-37.81810,1020000.0

In [28]:
 melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].isnull().sum()

BuildingArea    21115
YearBuilt       19306
Landsize            0
Car                 0
Bathroom         8226
Bedroom2         8217
Longtitude       7976
Lattitude        7976
Price            7610
dtype: int64

In [29]:
melb_data['Bathroom'] = melb_data['Bathroom'].fillna(melb_data['Bathroom'].mean())

In [31]:
melb_data['Bedroom2'] = melb_data['Bedroom2'].fillna(melb_data['Bedroom2'].mean())

In [32]:
 melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].isnull().sum()

BuildingArea    21115
YearBuilt       19306
Landsize            0
Car                 0
Bathroom            0
Bedroom2            0
Longtitude       7976
Lattitude        7976
Price            7610
dtype: int64

In [36]:
melb_data['Longtitude'] = melb_data['Longtitude'].fillna(melb_data['Longtitude'].mean())
melb_data['Lattitude'] = melb_data['Lattitude'].fillna(melb_data['Lattitude'].mean())
melb_data['Price'] = melb_data['Price'].fillna(melb_data['Price'].mean())

In [37]:
 melb_data[['BuildingArea', 'YearBuilt', 'Landsize', 'Car','Bathroom', 'Bedroom2', 'Longtitude', 'Lattitude', 'Price' ]].isnull().sum()

BuildingArea    21115
YearBuilt       19306
Landsize            0
Car                 0
Bathroom            0
Bedroom2            0
Longtitude          0
Lattitude           0
Price               0
dtype: int64

In [38]:
melb_data.dropna(thresh=int(melb_data.shape[0]* .9),axis=1, inplace=True)

In [39]:
melb_data.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Distance', 'Postcode', 'Bedroom2', 'Bathroom', 'Car',
       'Landsize', 'CouncilArea', 'Lattitude', 'Longtitude', 'Regionname',
       'Propertycount'],
      dtype='object')

In [40]:
melb_data.isnull().sum()

Suburb           0
Address          0
Rooms            0
Type             0
Price            0
Method           0
SellerG          0
Date             0
Distance         1
Postcode         1
Bedroom2         0
Bathroom         0
Car              0
Landsize         0
CouncilArea      3
Lattitude        0
Longtitude       0
Regionname       3
Propertycount    3
dtype: int64

In [47]:
melb_data['Distance'] = melb_data['Distance'].fillna(melb_data['Distance'].mean())
melb_data['Postcode'] = melb_data['Postcode'].fillna(melb_data['Postcode'].mean())
melb_data['CouncilArea'] = melb_data['CouncilArea'].fillna(melb_data['CouncilArea'].mode()[0])
melb_data['Regionname'] = melb_data['Regionname'].fillna(melb_data['Regionname'].mode()[0])
melb_data['Propertycount'] = melb_data['Propertycount'].fillna(melb_data['Propertycount'].mean())

In [48]:
melb_data.isnull().sum()

Suburb           0
Address          0
Rooms            0
Type             0
Price            0
Method           0
SellerG          0
Date             0
Distance         0
Postcode         0
Bedroom2         0
Bathroom         0
Car              0
Landsize         0
CouncilArea      0
Lattitude        0
Longtitude       0
Regionname       0
Propertycount    0
dtype: int64

In [49]:
melb_data.to_csv('datasets/melb_data_processed.csv', index=False)

'ls' is not recognized as an internal or external command,
operable program or batch file.